app/Models/ProductModel.php

    public function getAllProducts() {
        return $this->findAll();
---
SELECT *
FROM `products`

    public function getProduct($id) {
        return $this->find($id);
---
SELECT *
FROM `products`
WHERE `products`.`id` = '17'